[
    {
        "chapter": 2,
        "verse": 3,
        "text": "Улар Ғайбга иймон келтирурлар, намоз ўқирлар ва Биз уларга берган ризқдан нафақа қилурлар. (Ушбу оятда Қуръон ҳидоятидан баҳраманд бўла оладиган тақводорларнинг сифатларидан учтаси саналган: Биринчиси-\"ғайбга иймон келтирурлар\". Абул Олия ғайбга иймон келтиришнинг тафсирида: \"Аллоҳга, Унинг фаришталарига, китобларига, Пайғамбарларига, қиёмат кунига, жаннатига, дўзахига, мулоқотига, ўлимдан кейинги ҳаётга ва қайта тирилишга ишонишдир\", деган эканлар. Иккинчиси-\"намоз ўқирлар\". Яъни, Аллоҳга ибодат қиладилар. Бандага қул бўлишдан озод бўлиб, бандаларнинг Парвардигорига қул бўладилар. Намоз орқали банда Аллоҳ таолога боғланади. Ҳаётида ерга қапишиб юришдан юқори нарсани топади. Шунингдек, бошқа улкан яхшиликларга эришади. Учинчиси-\"Биз уларга берган ризқдан нафақа қилурлар\". Мўмин-мусулмоннинг, тақводор одамнинг эътиқоди бўйича, унинг қўлидаги мол-дунё Аллоҳ берган ризқ, ўзи яратган нарса эмас. Шунинг учун ҳам тақводор инсон Аллоҳ берган ризқдан ўзининг заифҳол, муҳтож биродарларига садақа қилади. \"Садақа\" сўзини тасдиқ маъноси бор, мол-дунёсини сарфлаб садақа қилишда эътиқоддаги маънонинг, яъни, яхшилик қилиш маъносининг тасдиғи бор. \"Нафақа\" ўзи умумий сўз бўлиб, закот, хайр-эҳсон, садақа каби маъноларни англатади)"
    },
    {
        "chapter": 2,
        "verse": 4,
        "text": "Ва улар сенга ва сендан олдин нозил қилинган нарсага иймон келтирурлар ва охиратга аниқ ишонурлар. (Демак, тақводорларга оид навбатдаги тўртинчи сифат-Муҳаммад алайҳиссаломга нозил қилинган Қуръони Каримга ва у кишидан олдин туширилган самовий китобларга иймон келтириш. Бу нарса, Ислом умматининг буюк сифатларидан бири бўлиб, бошқа ҳеч бир умматда йўқдир. Чунки Ислом умматидан бошқа ҳеч бир уммат Аллоҳдан нозил бўлган барча китобларга бирдек иймон келтирмаган. Ислом уммати Аллоҳ туширган барча китобларга бирдек иймон келтиради)"
    },
    {
        "chapter": 2,
        "verse": 5,
        "text": "Ана ўшалар Роббиларидан бўлган ҳидоятидадирлар ва ана ўшалар, ўшаларгина нажот топгувчилардир. (Ким нажот топишни истаса, ўзида тақводорлик сифатларини мужассам қилишга уринсин)"
    }
]